HamAndEggs/src/jbiServiceUnits/HamAndEggsBPEL/hamandeggs.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="hamandeggs" targetNamespace="http://j2ee.netbeans.org/wsdl/HamAndEggsBPEL/src/hamandeggs"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/HamAndEggsBPEL/src/hamandeggs" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="hamandeggsOperationRequest">
        <part name="n" type="xsd:int"/>
    </message>
    <message name="hamandeggsOperationResponse">
        <part name="eggs" type="xsd:int"/>
    </message>
    <portType name="hamandeggsPortType">
        <operation name="hamandeggsOperation">
            <input name="input1" message="tns:hamandeggsOperationRequest"/>
            <output name="output1" message="tns:hamandeggsOperationResponse"/>
        </operation>
    </portType>
    <binding name="hamandeggsBinding" type="tns:hamandeggsPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="hamandeggsOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/HamAndEggsBPEL/src/hamandeggs"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/HamAndEggsBPEL/src/hamandeggs"/>
            </output>
        </operation>
    </binding>
    <service name="hamandeggsService">
        <port name="hamandeggsPort" binding="tns:hamandeggsBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/hamandeggsService/hamandeggsPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="hamandeggs">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="hamandeggsPortTypeRole" portType="tns:hamandeggsPortType"/>
    </plnk:partnerLinkType>
</definitions>